[{"time": "2021-02-27 07:08:58", "text": "Doggie-Dos In LaMesa (on Baltimore?).  They do great work, are super nice, reasonably priced and they don’t put the dogs in cages.  They all just hang out together - my goldendoodle loves that but it’s too stressful for my Maltese, so if you have a shy and /or poorly socialized pup they probably won’t like it."}, {"time": "2021-01-30 07:59:31", "text": "Most terriers fit that bill.  I had an Australian Terrier (RIP) that was 12 lbs of pure tenacity and adventure.  Border terriers are really cool and are ranked #2 in intelligence.  Good luck!"}, {"time": "2021-01-29 16:32:59", "text": "My mom used to call the trail Fat Man’s Misery.  Back in the late 60s she would take me and my 2 siblings down that trail.  We were all under 10.  Things like this make me wonder how we survived our childhood!"}, {"time": "2021-01-28 16:42:25", "text": "Oak oasis is a beautiful but easy hike."}, {"time": "2021-01-22 17:26:57", "text": "Put a salt lick in the cage and see if that helps."}, {"time": "2021-01-21 23:27:18", "text": "papillon / some sort of spaniel cross"}, {"time": "2021-01-20 17:17:47", "text": "Susie Thai on Uni near college ave.  She’s super sweet and a great seamstress."}, {"time": "2021-01-18 14:18:06", "text": "Def sharpei."}, {"time": "2021-01-11 07:03:44", "text": "You did the right thing.\n\nYears ago my estranged father was found walking in the freeway talking to himself and having hallucinations.  This was up in OC and a cousin of mine who was a sheriff just happened to see the report (we have an unusual last name).  My dad had been homeless, living with dementia and because of this chance encounter we were able to reunite with him and find him a decent nursing home to live his last days out. \n\nI hope the man you saw was ok and found the help he needs."}, {"time": "2021-01-09 17:40:16", "text": "Wiggly bones!"}, {"time": "2021-01-09 17:15:43", "text": "That is one handsome boy!"}, {"time": "2021-01-07 08:41:32", "text": "I see Van Gogh."}, {"time": "2021-01-01 17:05:18", "text": "I’m wondering if it would be better to use the other cage since it’s bigger?"}, {"time": "2020-12-27 17:19:46", "text": "SD Tint is the best around.  I have a Prius prime with the concave rear window and it turned out perfectly.  The owner is really good about recommending the level of tint you’re looking for.  This is the only place me and my family take our cars.  It’s on Uni Ave in la Mesa."}, {"time": "2020-12-25 16:32:39", "text": "Don’t get those pedi perches.  They can cause bumblefoot (painful callouses on the pads of the foot) which is much more serious than long nails.  \n\nIt’s easy to trim canary nails yourself.  You may need someone to help hold the bird or do the clipping. Catch your bird and hold it with a small cloth over it.   Hold the bird lying face up in your hand, don’t hold too tightly but you don’t want the bird to be able to squirm around either.  Using nail clippers that you use on yourself, clip just a small amount of nail.  If you can’t see the ‘quick’ (where blood goes into the nail) take a flashlight and shine it below the nail so you know how much you can trim. Good luck!"}, {"time": "2020-12-24 16:16:47", "text": "Bridge of Hope on Fairmont Ave!  They give everything away and help many in the refugee community.  I hope everyone considers helping them out bc they do great work."}, {"time": "2020-12-22 06:15:44", "text": "Pls consider donating to Bridge of Hope on Fairmont Ave.  They don’t sell the stuff that comes in, they give it away to really needy folks including many in the refugee community."}, {"time": "2020-12-22 06:07:13", "text": "Bridge of Hope is a really worthy charity that does great work.  They don’t charge for their goods, but give them away for free and help many in the refugee community.  They’re on Fairmont Ave."}, {"time": "2020-12-21 05:32:54", "text": "I’ll 3rd SD tint.  I have a Prius prime with the concave  back window and it came out perfectly.  This was the 2nd car I’ve had done there and all my family members have used them as well."}, {"time": "2020-12-20 17:45:00", "text": "Looks just like my goldendoodle when he was a wee pup."}, {"time": "2020-12-19 07:13:35", "text": "Iowa Meat Farms would be #1.  Valley Farms in casa de Oro is smaller but has some really good stuff.  They also have a little bbq shack in the parking lot which is, I think, the best bbq in SD hands down."}, {"time": "2020-12-18 06:33:15", "text": "I tease my boyfriend for having a thing for daggie but she really is the best weather person in town.  You can tells she has a passion for it and seems like such a sweet person."}, {"time": "2020-12-18 06:29:20", "text": "I have a goldendoodle (2 water dog breeds) that would be sitting on the shore with the huskies and bulldogs.  Just not his thing I guess."}, {"time": "2020-12-18 06:26:53", "text": "Cute pup!  That was going to be my guess by the looks of that nose.  I have a white goldendoodle who is super curly.  I wish he had the wavy coat like yours."}, {"time": "2020-12-18 06:20:57", "text": "I must have been 4 or 5 and we lived in CV back in the late 60’s.  My siblings and I would see it and sing this song about how we were almost home."}]